# Lesson 4 Class Exercises: Pandas Part 2

With these class exercises we learn a few new things.  When new knowledge is introduced you'll see the icon shown on the right: 
<span style="float:right; margin-left:10px; clear:both;">![Task](../media/new_knowledge.png)</span>
## Get Started
Import the Numpy and Pandas packages

In [1]:
import pandas as pd
import numpy as np

## Exercise 1: Review of Pandas Part 1
### Task 1: Explore the data
Import the data from the [Lectures in Quantiatives Economics](https://github.com/QuantEcon/lecture-source-py) regarding minimum wages in countries round the world in US Dollars.  You can view the data [here](https://github.com/QuantEcon/lecture-source-py/blob/master/source/_static/lecture_specific/pandas_panel/realwage.csv) and you can access the data file here: https://raw.githubusercontent.com/QuantEcon/lecture-source-py/master/source/_static/lecture_specific/pandas_panel/realwage.csv.  Then perform the following

Import the data into a variable named `minwages` and print the first 5 lines of data to explore what is there.

In [2]:
minwages = pd.read_csv('https://raw.githubusercontent.com/QuantEcon/lecture-source-py/master/source/_static/lecture_specific/pandas_panel/realwage.csv')
minwages.head()

,Unnamed: 0,Time,Country,Series,Pay period,value
0,0,2006-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17132.443
1,1,2007-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18100.918
2,2,2008-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17747.406
3,3,2009-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18580.139
4,4,2010-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18755.832

Find the shape of the data.

In [3]:
minwages.shape

(1408, 6)

List the column names.

In [4]:
minwages.columns

Index(['Unnamed: 0', 'Time', 'Country', 'Series', 'Pay period', 'value'], dtype='object')

Identify the data types. Do they match what you would expect?

In [5]:
minwages.dtypes

Unnamed: 0      int64
Time           object
Country        object
Series         object
Pay period     object
value         float64
dtype: object

Identify columns with missing values.

In [6]:
minwages.isna().sum()

Unnamed: 0     0
Time           0
Country        0
Series         0
Pay period     0
value         68
dtype: int64

Identify if there are duplicated entires.

In [7]:
minwages.duplicated().sum()

0

How many unique values per row are there.  Do these look reasonable for the data type and what you know about what is stored in the column?

In [8]:
minwages.nunique()

Unnamed: 0    1408
Time            11
Country         32
Series           2
Pay period       2
value         1289
dtype: int64

### Task 2: Explore More

Retrieve descriptive statistics for the data.

In [9]:
minwages.describe()

        Unnamed: 0         value
count  1408.000000   1340.000000
mean    703.500000   5697.843084
std     406.598901   7475.920784
min       0.000000      0.234000
25%     351.750000      4.388742
50%     703.500000    290.606495
75%    1055.250000  10501.730500
max    1407.000000  25713.797000

Identify all of the countries listed in the data.

In [10]:
minwages['Country'].unique()

array(['Ireland', 'Spain', 'Australia', 'Turkey', 'Luxembourg',
       'New Zealand', 'United Kingdom', 'Mexico', 'Greece',
       'Slovak Republic', 'Portugal', 'France', 'United States', 'Japan',
       'Netherlands', 'Estonia', 'Hungary', 'Poland', 'Czech Republic',
       'Canada', 'Korea', 'Slovenia', 'Chile', 'Israel', 'Belgium',
       'Germany', 'Brazil', 'Russian Federation', 'Lithuania', 'Latvia',
       'Colombia', 'Costa Rica'], dtype=object)

Convert the time column to a datetime object.

In [11]:
minwages['Time'] = pd.to_datetime(minwages['Time'])

List the time points that were used for data collection. How many years of data collection were there? What time of year were the data collected?

In [12]:
minwages['Time'].unique()

array(['2006-01-01T00:00:00.000000000', '2007-01-01T00:00:00.000000000',
       '2008-01-01T00:00:00.000000000', '2009-01-01T00:00:00.000000000',
       '2010-01-01T00:00:00.000000000', '2011-01-01T00:00:00.000000000',
       '2012-01-01T00:00:00.000000000', '2013-01-01T00:00:00.000000000',
       '2014-01-01T00:00:00.000000000', '2015-01-01T00:00:00.000000000',
       '2016-01-01T00:00:00.000000000'], dtype='datetime64[ns]')

Because we only have one data point collected per year per country, simplify this by adding a new column with just the year.  Print the first 5 rows to confirm the column was added.

In [13]:
minwages['Year'] = minwages['Time'].dt.year
minwages.head()

,Unnamed: 0,Time,Country,Series,Pay period,value,Year
0,0,2006-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17132.443,2006
1,1,2007-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18100.918,2007
2,2,2008-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17747.406,2008
3,3,2009-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18580.139,2009
4,4,2010-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18755.832,2010

There are two pay periods.  Retrieve them in a list of just the two strings

In [14]:
minwages['Pay period'].unique()

array(['Annual', 'Hourly'], dtype=object)

### Task 3: Clean the data
We have no duplicates in this data so we do not need to consider removing those, but we do have missing values in the `value` column. Lets remove those.  Check the dimensions afterwards to make sure they rows with missing values are gone.

In [15]:
minwages.dropna(inplace=True)
minwages.shape

(1340, 7)

Remove the "Unnamed: 0" column as it's not needed.

In [16]:
minwages.drop(['Unnamed: 0'], axis=1, inplace=True)

### Task 4:  Indexing
Use boolean indexing to retrieve the rows of annual salary in United States

In [17]:
minwages[(minwages['Country'] == "United States") & (minwages['Pay period'] == 'Annual')]

,Time,Country,Series,Pay period,value,Year
528,2006-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,12594.397,2006
529,2007-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,12974.395,2007
530,2008-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,14097.556,2008
531,2009-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15756.423,2009
532,2010-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,16391.313,2010
533,2011-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15889.705,2011
534,2012-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15567.554,2012
535,2013-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15342.814,2013
536,2014-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15097.890,2014
537,2015-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,15080.000,2015
538,2016-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,14892.122,2016
550,2006-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,12594.397,2006
551,2007-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,12974.395,2007
552,2008-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,14097.556,2008
553,2009-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15756.423,2009
554,2010-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,16391.313,2010
555,2011-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15889.705,2011
556,2012-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15567.554,2012
557,2013-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15342.814,2013
558,2014-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15097.890,2014
559,2015-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,15080.000,2015
560,2016-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,14892.122,2016

Do we have enough data to calculate descriptive statistics for annual salary in the United States in 2016?

In [18]:
minwages[(minwages['Country'] == "United States") & (minwages['Pay period'] == 'Annual') & (minwages['Year'] == 2016)]

,Time,Country,Series,Pay period,value,Year
538,2016-01-01,United States,In 2015 constant prices at 2015 USD PPPs,Annual,14892.122,2016
560,2016-01-01,United States,In 2015 constant prices at 2015 USD exchange r...,Annual,14892.122,2016

Use `loc` to calculate descriptive statistics for the hourly salary in the United States and then again separately for Ireland. Hint: you will have to set row indexes.  Hint: you should reset the index before using `loc`

In [19]:
minwages.index = minwages['Country']

In [20]:
minwages[minwages['Pay period'] == 'Hourly'].loc['United States'].describe()

           value         Year
count  22.000000    22.000000
mean    7.154966  2011.000000
std     0.560776     3.236694
min     6.055000  2006.000000
25%     6.875870  2008.250000
50%     7.258800  2011.000000
75%     7.555215  2013.750000
max     7.880440  2016.000000

In [21]:
minwages[minwages['Pay period'] == 'Hourly'].loc['Ireland'].describe()

           value         Year
count  22.000000    22.000000
mean    9.202719  2011.000000
std     0.569146     3.236694
min     8.236750  2006.000000
25%     8.658740  2008.250000
50%     9.142550  2011.000000
75%     9.622250  2013.750000
max    10.148000  2016.000000

Now do the same for Annual salary

In [22]:
minwages[minwages['Pay period'] == 'Annual'].loc['Ireland'].describe()

              value         Year
count     22.000000    22.000000
mean   19141.667591  2011.000000
std     1183.797682     3.236694
min    17132.443000  2006.000000
25%    18010.186750  2008.250000
50%    19016.649500  2011.000000
75%    20014.755500  2013.750000
max    21107.758000  2016.000000

In [23]:
minwages[minwages['Pay period'] == 'Annual'].loc['United States'].describe()

              value         Year
count     22.000000    22.000000
mean   14880.379000  2011.000000
std     1167.568383     3.236694
min    12594.397000  2006.000000
25%    14296.197500  2008.250000
50%    15097.890000  2011.000000
75%    15709.205750  2013.750000
max    16391.313000  2016.000000

## Exercise 2: Occurances
First, reset the indexes back to numeric values. Print the first 10 lines to confirm.

In [24]:
minwages.reset_index(drop=True, inplace=True)
minwages.head()

,Time,Country,Series,Pay period,value,Year
0,2006-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17132.443,2006
1,2007-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18100.918,2007
2,2008-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,17747.406,2008
3,2009-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18580.139,2009
4,2010-01-01,Ireland,In 2015 constant prices at 2015 USD PPPs,Annual,18755.832,2010

Get the count of how many rows there are per year?

In [ ]:
minwages['Year'].value_counts()

## Exercise 3: Grouping
### Task 1: Aggregation
Calculate the average salary for each country across all years.

In [ ]:
mwannual = minwages[(minwages['Pay period'] == 'Annual')]
mwannual[['Country','value']].groupby('Country').mean().head()

Calculate the average salary and hourly wage for each country across all years. Save the resulting dataframe containing the means into a new variable named `mwmean`.

In [ ]:
mwgroup = minwages[['Country', 'Pay period', 'value']].groupby(['Country', 'Pay period'])
mwmean = mwgroup.mean()
mwmean.head()

In [ ]:
mwgroup

<span style="float:right; margin-left:10px; clear:both;">![Task](../media/new_knowledge.png)</span>

Above we saw how to aggregate using built-in functions of the `DataFrameGroupBy` object. For eaxmple we called the `mean` function directly. These handly functions help with writing succint code. However, you can also use the `aggregate` function to do more! You can learn more on the [aggregate description page](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html)

With `aggregate` we can perform operations across rows and columns, and we can perform more than one operation at a time.  Explore the online documentation for the function and see how you would calculate the mean, min, and max for each country and pay period type, as well as the total number of records per country and pay period:

In [ ]:
mwgroup.aggregate(['mean', 'min', 'max', 'count'])

Also you can use the aggregate on a single column of the grouped object. For example:

```python
    mwgroup = minwages[['Country', 'Pay period', 'value']].groupby(['Country', 'Pay period'])
    mwgroup['value'].aggregate(['mean'])

```
Redo the aggregate function in the previous cell but this time apply it to a single column.

In [ ]:
mwgroup['value'].aggregate(['mean', 'min', 'max', 'count'])

### Task 2: Slicing/Indexing
<span style="float:right; margin-left:10px; clear:both;">![Task](../media/new_knowledge.png)</span>

In the following code the resulting dataframe should contain only one data column: the mean values. It does, however, have two levels of indexes: Country and Pay period.  For example:

```python
mwgroup = minwages[['Country', 'Pay period', 'value']].groupby(['Country', 'Pay period'])
mwmean = mwgroup.mean()
mwmean
```

Try it out:

In [ ]:
mwgroup = minwages[['Country', 'Pay period', 'value']].groupby(['Country', 'Pay period'])
mwmean = mwgroup.mean()
mwmean

Notice in the output above there are two levels of indexes. This is called MultiIndexing.  In reality, there is only one data column and two index levels.  So, you can do this:

```python
mwmean['value']
```

But you can't do this:

```python
mwmean['Pay period']
```

Why not? Try it:

In [ ]:
mwmean['value']

In [ ]:
mwmean['Pay period']

The reason we cannot exeucte `mwmean['Pay period']` is because `Pay period` is not a data column. It's an index.  Let's learn how to use MultiIndexes to retrieve data. You can learn more about it on the [MultiIndex/advanced indexing page](https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html#advanced-indexing-with-hierarchical-index)

First, let's take a look at the indexes using the `index` attribute. 

```python
mwmean.index
```

Try it:

In [ ]:
mwmean.index

Notice that each index is actually a tuple with two levels. The first is the country names and the second is the pay period. Remember, we can use the `loc` function, to slice a dataframe using indexes.  We can do so with a MultiIndexed dataframe as well. For example, to extract all elements with they index named 'Australia':

```python
mwmean.loc[('Australia')]
```

Try it yourself:

In [ ]:
mwmean.loc[('Australia')]

You can specify both indexes to pull out a single row. For example, to find the average hourly salary in Australia:

```python
mwmean.loc[('Australia','Hourly')]
```
Try it yourself:

In [ ]:
mwmean.loc[('Australia','Hourly')]

Suppose you wanted to retrieve all of the mean "Hourly" wages. For MultiIndexes, there are multiple ways to slice it, some are not entirely intuitive or flexible enough.  Perhaps the easiest is to use the `pd.IndexSlice` object.  It allows you to specify an index format that is intuitive to the way you've already learned to slice.  For example:

```python
idx = pd.IndexSlice
mwmean.loc[idx[:,'Hourly'],:]
```

In the code above the `idx[:, 'Hourly']` portion is used in the "row" indexor position of the `loc` function. It indicates that we want all possible first-level indexes (specified with the `:`) and we want second-level indexes to be restricted to "Hourly".  
Try it out yourself:

In [ ]:
idx = pd.IndexSlice
mwmean.loc[idx[:,'Hourly'],:].head()

Using what you've learned above about slicing the MultiIndexed dataframe, find out which country has had the highest average annual salary.

In [ ]:
meanmwa = mwmean.loc[idx[:, 'Annual'], 'value']
meanmwa[meanmwa == meanmwa.max()]

You can move the indexes into the dataframe and reset the index to a traditional single-level numeric index by reseting the indexes:    
```python
mwmean.reset_index()
```

Try it yourself:

### Task 3: Filtering the original data.
<span style="float:right; margin-left:10px; clear:both;">![Task](../media/new_knowledge.png)</span>

Another way we might want to filter is to find records in the dataset that, after grouping meets some criteria. For example, what if we wanted to find the records for all countries with the average annual salary was greater than $35K?

To do this, we can use the `filter` function of the `DataFrameGroupBy` object. The filter function must take a function as an argument (this is new and may seem weird).  

```python
annualwages = minwages[minwages['Pay period'] == 'Annual']
annualwages.groupby(['Country']).filter(
    lambda x : x['value'].mean() > 22000
)
```
Try it:

In [ ]:
annualwages = minwages[minwages['Pay period'] == 'Annual']
annualwages.groupby(['Country']).filter(
    lambda x : x['value'].mean() > 22000
)

### Task 4: Reset the index
If you do not want to use MultiIndexes and you prefer to return any Multiindex dataset back to a traditional 1-level index dataframe you can use the`reset_index` function. 

Try it out on the `mwmean` dataframe:

In [ ]:
mwmean.reset_index().head()

## Exercise 4:  Task 6d from the practice notebook
Load the iris dataset. 

In the Iris dataset:
+ Create a new column with the label "region" in the iris data frame. This column will indicates geographic regions of the US where measurments were taken. Values should include:  'Southeast', 'Northeast', 'Midwest', 'Southwest', 'Northwest'. Use these randomly.
+ Use `groupby` to get a new data frame of means for each species in each region.
+ Add a `dev_stage` column by randomly selecting from the values "early" and "late".
+ Use `groupby` to get a new data frame of means for each species, in each region and each development stage.
+ Use the `count` function (just like you used the `mean` function) to identify how many rows in the table belong to each combination of species + region + developmental stage.

In [ ]:
iris = pd.read_csv('data/iris.csv')
iris.head()

In [ ]:
iris['region'] = np.random.choice(['Southeast', 'Northeast', 'Midwest', 'Southwest', 'Northwest'], 150)
iris.head()

In [ ]:
iris.groupby(['species', 'region']).mean()

In [ ]:
iris['dev_stage'] = np.random.choice(['early', 'late'], 150)
iris.head()

In [ ]:
iris.groupby(['species', 'region', 'dev_stage']).count().head()

## Exercise 5: Kaggle Titanic Dataset
A dataset of Titanic passengers and their fates is provided by the online machine learning competition server [Kaggle](https://www.kaggle.com/). See the [Titanic project](https://www.kaggle.com/c/titanic) page for more details. 

Let's practice all we have learned thus far to explore and perhaps clean this dataset.  You have been provided with the dataset named `Titanic_train.csv`.  

### Task 1: Explore the data
First import the data and print the first 10 lines.

In [4]:
pwd

'C:\\Users\\shres\\afs505_u2\\Data-Analytics-With-Python\\class_exercises'

In [7]:
titanic = pd.read_csv('C:\\Users\\shres\\afs505_u2\\Data-Analytics-With-Python\\data\\Titanic_train.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Find the shape of the data.

In [8]:
titanic.shape

(891, 12)

List the column names.

In [9]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Identify the data types. Do they match what you would expect?

In [10]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

Identify columns with missing values.

In [14]:
titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Identify if there are duplicated entires.

In [12]:
titanic.duplicated().sum()

0

How many unique values per row are there.  Do these look reasonable for the data type and what you know about what is stored in the column?

In [13]:
titanic.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

### Task 2: Clean the data
Do missing values need to be removed? If so, remove them.

Do duplicates need to be removed?  If so remove them.

### Task 3: Find Interesting Facts
Count the number of passengers that survied and died in each passenger class

In [17]:
scounts = titanic.groupby(['Pclass','Survived']).count()
scounts['PassengerId']

Pclass  Survived
1       0            52
        1           106
2       0             3
        1            12
3       0             5
        1             5
Name: PassengerId, dtype: int64

Were men or women more likely to survive?

In [21]:
scounts = titanic.groupby(['Survived', 'Sex']).count()
scounts

                 PassengerId  Pclass  Name  Age  SibSp  Parch  Ticket  Fare  \
Survived Sex
0        female            6       6     6    6      6      6       6     6
         male             54      54    54   54     54     54      54    54
1        female           82      82    82   82     82     82      82    82
         male             41      41    41   41     41     41      41    41

                 Cabin  Embarked
Survived Sex
0        female      6         6
         male       54        54
1        female     82        82
         male       41        41

What was the average, min and max ticket prices per passenger class?
Hint:  look at the help page for the [agg](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html) function to help simplify this.

In [22]:
scounts = titanic.dropna().groupby(['Pclass']).agg(['mean', 'min', 'max'])
scounts['Fare']

             mean    min       max
Pclass
1       88.683228   0.00  512.3292
2       18.444447  10.50   39.0000
3       11.027500   7.65   16.7000

Give descriptive statistics about the survival age.

In [23]:
titanic[(titanic['Survived'] == 1)]['Age'].dropna().describe()

count    123.000000
mean      32.905854
std       14.890113
min        0.920000
25%       23.000000
50%       33.000000
75%       42.000000
max       80.000000
Name: Age, dtype: float64